#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.es_cluster.data.aws_iam_policy_document.cognito_auth_policy_doc[0]: Refreshing state...
module.es_cluster.data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Refreshing state...
module.es_cluster.data.aws_iam_policy.kibana_cognito_policy[0]: Refreshing state...
module.es_cluster.data.aws_iam_policy_document.elasticsearch_cognito_trust_policy_doc[0]: Refreshing state...
module.prod_network.data.aws_availability_zones.all: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.es_cluster.data.aws_iam_policy_document.cognito_auth_trust_relationship_policy_doc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cognito_auth_trust_relationship_policy_doc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.es_cluster.data.aws_iam_policy_document.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this"  {
      + id      = "854916557"
      + json    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "es:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::116722176476:role/fishtech-kibana",
                              + "arn:aws:iam::116722176476:role/fishtech-cognito",
                            ]
                        }
                      + Resource  = "arn:aws:es:us-east-1:116722176476:domain/prod/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version = "2012-10-17"

      + statement {
          + actions       = [
              + "es:*",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:aws:es:us-east-1:116722176476:domain/prod/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::116722176476:role/fishtech-cognito",
                  + "arn:aws:iam::116722176476:role/fishtech-kibana",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.es_cluster.aws_cloudwatch_log_group.es_app_logs will be created
  + resource "aws_cloudwatch_log_group" "es_app_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "app-logs"
      + retention_in_days = 7
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.es_cluster.aws_cloudwatch_log_group.es_index_logs will be created
  + resource "aws_cloudwatch_log_group" "es_index_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "index-logs"
      + retention_in_days = 7
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.es_cluster.aws_cloudwatch_log_group.es_slow_logs will be created
  + resource "aws_cloudwatch_log_group" "es_slow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "slow-logs"
      + retention_in_days = 7
      + tags              = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
    }

  # module.es_cluster.aws_cloudwatch_log_resource_policy.elasticsearch-log-publishing-policy will be created
  + resource "aws_cloudwatch_log_resource_policy" "elasticsearch-log-publishing-policy" {
      + id              = (known after apply)
      + policy_document = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "logs:PutLogEventsBatch",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "es.amazonaws.com"
                        }
                      + Resource  = "arn:aws:logs:*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_name     = "elasticsearch-log-publishing-policy"
    }

  # module.es_cluster.aws_cognito_identity_pool.kibana_identity_pool[0] will be created
  + resource "aws_cognito_identity_pool" "kibana_identity_pool" {
      + allow_unauthenticated_identities = false
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "fishtech"
    }

  # module.es_cluster.aws_cognito_identity_pool_roles_attachment.this[0] will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "this" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = (known after apply)
    }

  # module.es_cluster.aws_cognito_user_pool.kibana_user_pool[0] will be created
  + resource "aws_cognito_user_pool" "kibana_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "fishtech"
      + sms_verification_message   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "email"
          + required            = true

          + string_attribute_constraints {
              + max_length = "256"
              + min_length = "1"
            }
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.es_cluster.aws_cognito_user_pool_domain.this[0] will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "fishtech"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # module.es_cluster.aws_elasticsearch_domain.es will be created
  + resource "aws_elasticsearch_domain" "es" {
      + access_policies       = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "es:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::116722176476:role/fishtech-kibana",
                              + "arn:aws:iam::116722176476:role/fishtech-cognito",
                            ]
                        }
                      + Resource  = "arn:aws:es:us-east-1:116722176476:domain/prod/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + advanced_options      = (known after apply)
      + arn                   = (known after apply)
      + domain_id             = (known after apply)
      + domain_name           = "prod"
      + elasticsearch_version = "6.8"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + kibana_endpoint       = (known after apply)
      + tags                  = {
          + "app" = "fishtech"
          + "env" = "prod"
        }

      + advanced_security_options {
          + enabled                        = (known after apply)
          + internal_user_database_enabled = (known after apply)

          + master_user_options {
              + master_user_arn      = (known after apply)
              + master_user_name     = (known after apply)
              + master_user_password = (sensitive value)
            }
        }

      + cluster_config {
          + dedicated_master_count   = 3
          + dedicated_master_enabled = true
          + dedicated_master_type    = "t3.small.elasticsearch"
          + instance_count           = 2
          + instance_type            = "t3.small.elasticsearch"
          + zone_awareness_enabled   = true

          + zone_awareness_config {
              + availability_zone_count = 2
            }
        }

      + cognito_options {
          + enabled          = true
          + identity_pool_id = (known after apply)
          + role_arn         = (known after apply)
          + user_pool_id     = (known after apply)
        }

      + domain_endpoint_options {
          + enforce_https       = true
          + tls_security_policy = "Policy-Min-TLS-1-2-2019-07"
        }

      + ebs_options {
          + ebs_enabled = true
          + volume_size = 10
          + volume_type = (known after apply)
        }

      + encrypt_at_rest {
          + enabled    = true
          + kms_key_id = (known after apply)
        }

      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "ES_APPLICATION_LOGS"
        }
      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "INDEX_SLOW_LOGS"
        }
      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "SEARCH_SLOW_LOGS"
        }

      + node_to_node_encryption {
          + enabled = true
        }

      + vpc_options {
          + availability_zones = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.es_cluster.aws_iam_policy.cognito_auth_policy[0] will be created
  + resource "aws_iam_policy" "cognito_auth_policy" {
      + arn         = (known after apply)
      + description = "Authorizaation policy for kibana cognito identity pool"
      + id          = (known after apply)
      + name        = "fishtech"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "mobileanalytics:PutEvents",
                          + "es:ESHttp*",
                          + "cognito-sync:*",
                          + "cognito-identity:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:es:us-east-1:116722176476:domain/prod/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.es_cluster.aws_iam_role.cognito_auth_role[0] will be created
  + resource "aws_iam_role" "cognito_auth_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fishtech-cognito"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.es_cluster.aws_iam_role.kibana_cognito_role[0] will be created
  + resource "aws_iam_role" "kibana_cognito_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "es.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fishtech-kibana"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.es_cluster.aws_iam_role_policy_attachment.cognito_auth_role_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cognito_auth_role_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "fishtech-cognito"
    }

  # module.es_cluster.aws_iam_role_policy_attachment.kibana_cognito_role_policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "kibana_cognito_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonESCognitoAccess"
      + role       = "fishtech-kibana"
    }

  # module.es_cluster.aws_iam_service_linked_role.es will be created
  + resource "aws_iam_service_linked_role" "es" {
      + arn              = (known after apply)
      + aws_service_name = "es.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + unique_id        = (known after apply)
    }

  # module.es_cluster.aws_security_group.elasticsearch will be created
  + resource "aws_security_group" "elasticsearch" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "TLS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "allow_tls"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "app" = "fishtech"
          + "env" = "prod"
        }
      + vpc_id                 = (known after apply)
    }

  # module.prod_network.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "fishtech"
        }
      + vpc_id   = (known after apply)
    }

  # module.prod_network.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.prod_network.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "fishtech-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.prod_network.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "fishtech-private-us-east-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.prod_network.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "fishtech-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.prod_network.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.prod_network.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.prod_network.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.prod_network.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.prod_network.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-private-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.prod_network.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-private-us-east-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.prod_network.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-public-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.prod_network.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "fishtech-public-us-east-1b"
        }
      + vpc_id                          = (known after apply)
    }

  # module.prod_network.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "fishtech"
          + "app"  = "fishtech"
          + "env"  = "prod"
        }
    }

Plan: 30 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @brentmitchell25, Action: `pull_request`*